'''
A. A+B
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Это ваша первая задача. В ней вам придётся прочитать два числа и сложить их.
Результат необходимо вывести на стандартный поток вывода или в файл,
указанный в условии задачи.
Рекомендуем воспользоваться заготовками кода для данной задачи,
лежащими в репозитории курса.

Формат ввода
В первой строке задано первое число, во второй – второе.
Оба числа лежат в диапазоне.
Формат вывода
Выведите единственное число – результат сложения двух чисел.
'''
# def main(a, b):
#     return a + b


# if __name__ == '__main__':
#     print(main(int(input()), int(input())))

# def main(a, b):
#     return a + b


# if __name__ == '__main__':
#     with open('input.txt', 'r') as file_in:
#         a = int(file_in.readline())
#         b = int(file_in.readline())
#     result = main(a, b)

#     with open('output.txt', 'w') as file_out:
#         file_out.write(str(result))

# def main(a, b):
#     return a + b


# if __name__ == '__main__':
#     a = int(input())
#     b = int(input())
#     result = main(a, b)
#     print(result)
